{
  "backend/main.mo": "Main actor defining persistent state (user profiles, shop items, carts, purchases), UPI/website configuration, and public query/shared functions for shop management, cart operations, checkout, and admin controls with access control integration.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (shop browse, item detail, cart UI, admin panel) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing their purpose, including pages (shop, admin, home), components (header, modals, layout), hooks (React Query), and configuration files.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, defining color schemes for background, foreground, card, primary, secondary, muted, accent, destructive, border, and sidebar tokens.",
  "frontend/index.html": "HTML entry point with favicon references, viewport meta tag, Press Start 2P Google Font preconnect, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring React Router with lazy-loaded routes (shop, item detail, vote, discord, history, admin), QueryClient with aggressive caching, ThemeProvider, dynamic title updates, and Layout wrapper with Suspense boundaries.",
  "frontend/src/components/CheckoutModal.tsx": "Two-step checkout modal collecting Discord/Minecraft usernames, generating UPI QR codes via QR Server API, displaying payment instructions, and handling payment completion with error handling and retry logic.",
  "frontend/src/components/Community.tsx": "Empty file with no content.",
  "frontend/src/components/Features.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice with a heart icon, attribution to caffeine.ai, and a note about secure UPI payments.",
  "frontend/src/components/Header.tsx": "Header component with navigation links, logo, shopping cart badge, authentication controls, and admin settings dropdown. Includes mobile menu support and uses Internet Identity for auth.",
  "frontend/src/components/Hero.tsx": "Empty file with no content.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that includes Header, Footer, ProfileSetupModal, and applies natural scrolling and dynamic background styling from website config.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to set up their profile with name and Minecraft username fields. Cannot be dismissed until completed.",
  "frontend/src/components/ServerList.tsx": "Empty file with no content.",
  "frontend/src/components/ThemeToggle.tsx": "Empty file with no content.",
  "frontend/src/components/UPIQRCodeModal.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor instance with Internet Identity authentication, initializes access control with admin token, and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validity with configurable AuthClient options.",
  "frontend/src/hooks/useInvertedScroll.ts": "Empty file with no content.",
  "frontend/src/hooks/useNaturalScroll.ts": "Custom hook implementing natural scrolling behavior with touch acceleration for mobile devices, handling wheel and touch events while skipping custom scrolling for form elements and scrollable containers.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including admin checks, user profiles, shop items, cart management, UPI config, website config, purchase records, and order details with proper caching and invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for a dark theme with pink accents, utility classes for card glows, pixel headings, nav links, and accessibility support for reduced motion.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page for managing website configuration including logo (URL or blob upload), background settings (color or image), and other site settings with upload progress tracking and form state management.",
  "frontend/src/pages/DiscordPage.tsx": "Simple page displaying a Discord invitation card with the server's Discord invite link fetched from website configuration, featuring a centered layout with Discord icon and join button.",
  "frontend/src/pages/HistoryPage.tsx": "Purchase history page displaying user's past orders with status badges (approved/pending), timestamps, item details, and formatted date display in a card-based layout.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring a hero section with background image, server status display (online/offline with player count), voting site links, and feature cards showcasing server highlights.",
  "frontend/src/pages/ItemDetailPage.tsx": "Product detail page for shop items showing item information, category-specific icons, quantity selector, and add-to-cart functionality with authentication checks and navigation back to shop.",
  "frontend/src/pages/NotFoundPage.tsx": "404 error page displaying a centered message with a large '404' heading and a button to navigate back to the home page.",
  "frontend/src/pages/ShopManagementPage.tsx": "Admin-only page for managing shop items with create, edit, and delete functionality. Includes form validation, modal dialogs, and access control checks using useIsCallerAdmin hook.",
  "frontend/src/pages/ShopPage.tsx": "Main shop browsing page displaying items in a grid with category filtering, cart management (add/remove/update quantities), and checkout modal integration. Uses memoized ShopItemCard components for performance.",
  "frontend/src/pages/VotePage.tsx": "Static page displaying voting links for the Minecraft server, with configurable URLs loaded from website config or fallback defaults.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/src/utils/websiteAppearance.ts": "Helper functions for processing website appearance settings including logo URL extraction from blob/URL types, background style generation, and validation for image URLs and hex colors.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions for pixel font, pink glow effects, HSL color variables, and animation keyframes for accordion components.",
  "project_state.json": "Project state tracking document indicating Phase 1 shop features are implemented (browse, details, cart) with pending backend tasks to migrate from mo:core to mo:base imports only."
}