{
  "backend/main.mo": "Motoko backend defining configs, user profiles, shop items, carts, purchases, and access-controlled profile APIs.",
  "feature_evidence.json": "Feature evidence list mapping implemented UI features to files, components, and requirement IDs.",
  "frontend-file-summaries.txt": "Generated summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base styles defining color variables and dark mode theme tokens for the site.",
  "frontend/index.html": "HTML entry file loading fonts, favicon, and mounting the React app.",
  "frontend/src/App.tsx": "Main React app with router setup, lazy-loaded pages, query client config, and dynamic title handling.",
  "frontend/src/components/CheckoutModal.tsx": "Modal handling checkout flow, UPI QR generation, user info input, and payment completion callbacks.",
  "frontend/src/components/Community.tsx": "Empty placeholder component with no content.",
  "frontend/src/components/Features.tsx": "Empty placeholder component with no content.",
  "frontend/src/components/Footer.tsx": "Renders a styled footer with branding, a link to caffeine.ai, and a note about secure UPI payments.",
  "frontend/src/components/Header.tsx": "Implements the main site header with navigation, cart display, login/logout handling, and responsive mobile menu logic.",
  "frontend/src/components/Hero.tsx": "Empty placeholder component file.",
  "frontend/src/components/Layout.tsx": "Wraps the app with header, footer, natural scrolling, routing outlet, and conditionally shows the profile setup modal.",
  "frontend/src/components/ProfileSetupModal.tsx": "Displays a modal form for creating a user profile, validating input and saving via a mutation.",
  "frontend/src/components/ServerList.tsx": "Empty placeholder component file.",
  "frontend/src/components/ThemeToggle.tsx": "Empty placeholder component file.",
  "frontend/src/components/UPIQRCodeModal.tsx": "Empty placeholder component file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity login, logout, state management, and AuthClient setup.",
  "frontend/src/hooks/useInvertedScroll.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useNaturalScroll.ts": "Implements custom natural scrolling behavior for mouse and touch, skipping designated scrollable elements.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for admin checks, user profile CRUD, shop item operations, cart, and configuration data using the actor API.",
  "frontend/src/index.css": "Sets Tailwind base layers, custom CSS variables, global styles, and utility classes for animations and UI effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, rendering the App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Empty placeholder page for the admin dashboard.",
  "frontend/src/pages/DiscordPage.tsx": "Displays a Discord invite page that fetches config data and shows a join button with loading state.",
  "frontend/src/pages/HistoryPage.tsx": "Shows a user's purchase history with formatted dates, status badges, and item details using queried data.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero section, server status, and voting info, using config data and feature cards.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with a message and button linking back to home.",
  "frontend/src/pages/ShopPage.tsx": "Shop interface supporting filtering, cart management, item listing, and UPI checkout flow.",
  "frontend/src/pages/VotePage.tsx": "Vote page listing server voting links based on config with loading and fallback behavior.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), store and retrieve them from sessionStorage, and persist or clear them across navigation.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, fonts, animations, and container settings, plus plugins for animations, typography, and container queries.",
  "project_state.json": "Stores project metadata including redesign requirements, feature descriptions, image needs, and current versioning for the website overhaul."
}