{
  "backend/main.mo": "Defines main actor with storage, authorization, website config, shop data structures, and user profile/payment handling APIs.",
  "feature_evidence.json": "Empty feature evidence report structure with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing components, pages, and configuration.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS variables for light and dark themes and applying global styles.",
  "frontend/index.html": "Main HTML entry point loading fonts, favicon, and mounting the React app.",
  "frontend/src/App.tsx": "Sets up router, query client, theming, dynamic titles, and lazy-loaded pages within the app layout.",
  "frontend/src/components/CheckoutModal.tsx": "Modal for checkout flow handling username input, QR code UPI payment generation, and payment completion.",
  "frontend/src/components/Community.tsx": "Empty placeholder component file.",
  "frontend/src/components/Features.tsx": "Empty placeholder component file.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright, caffeine.ai link, and UPI payment notice.",
  "frontend/src/components/Header.tsx": "Full header component with navigation, auth handling, cart count, and dynamic logo from config.",
  "frontend/src/components/Hero.tsx": "Empty placeholder file.",
  "frontend/src/components/Layout.tsx": "Wraps page layout with header, footer, background config, and triggers profile setup modal.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile with name and Minecraft username, including validation and save mutation.",
  "frontend/src/components/ServerList.tsx": "Empty placeholder file.",
  "frontend/src/components/ThemeToggle.tsx": "Empty placeholder file.",
  "frontend/src/components/UPIQRCodeModal.tsx": "Empty placeholder file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor tied to identity, auto-invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity with login, logout, and identity restoration.",
  "frontend/src/hooks/useInvertedScroll.ts": "Empty placeholder file.",
  "frontend/src/hooks/useNaturalScroll.ts": "Implements natural and touch-accelerated scrolling while skipping form and scrollable elements.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for admin status, profiles, shop items, UPI config, and other backend interactions.",
  "frontend/src/index.css": "Defines Tailwind layers, CSS variables for theming, base styles, and custom utility classes including glow effects and reduced‑motion rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Implements an admin panel for editing website configuration including logo, background, and other appearance settings.",
  "frontend/src/pages/DiscordPage.tsx": "Displays a Discord invite page that loads the invite link from website config and shows a join button.",
  "frontend/src/pages/HistoryPage.tsx": "Shows a user's purchase history with timestamps, item details, and status badges.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero section, server status, configurable tagline, and voting links.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with a message and button linking back to the homepage.",
  "frontend/src/pages/ShopPage.tsx": "Provides the shop interface for browsing items, managing the cart, and initiating purchases via UPI.",
  "frontend/src/pages/VotePage.tsx": "Renders a vote page that loads vote site URLs from config or defaults and displays them with links and loading state.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/websiteAppearance.ts": "Utilities for resolving logo URLs, generating background styles, and validating image URLs and hex colors.",
  "frontend/tailwind.config.js": "Tailwind config extending theme with custom fonts, colors, animations, shadows, and plugin setup.",
  "project_state.json": "Project state describing issues with mo:core imports and listing feature requests to rewrite backend using mo:base only."
}