{
  "backend/main.mo": "Motoko backend actor managing user profiles, shop items, carts, purchases, and website/UPI config with access‑controlled queries and mutations.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Text file containing pre-written summaries of frontend source files.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS variables for light/dark themes and global styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React entry configuring router, theme provider, aggressive React Query caching, lazy-loaded pages, and dynamic title updates.",
  "frontend/src/components/CheckoutModal.tsx": "Purchase modal handling account info entry, UPI QR generation, and payment completion.",
  "frontend/src/components/Community.tsx": "Empty component file.",
  "frontend/src/components/Features.tsx": "Empty component file.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright, caffeine.ai link, and secure UPI payments text.",
  "frontend/src/components/Header.tsx": "Header with navigation, Internet Identity login/logout, cart count, and responsive mobile menu.",
  "frontend/src/components/Hero.tsx": "Empty component file.",
  "frontend/src/components/Layout.tsx": "Layout wrapper applying natural scroll and rendering header, outlet, and footer.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file.",
  "frontend/src/components/ServerList.tsx": "Empty file.",
  "frontend/src/components/ThemeToggle.tsx": "Empty file.",
  "frontend/src/components/UPIQRCodeModal.tsx": "Empty file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and auto‑invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login handling, and identity persistence via AuthClient.",
  "frontend/src/hooks/useInvertedScroll.ts": "Empty file.",
  "frontend/src/hooks/useNaturalScroll.ts": "Implements global natural scroll behavior for wheel and touch inputs with skip logic for scrollable elements.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for admin checks, shop items, UPI config, website config, and mutations using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and theme variables with performance and accessibility optimizations.",
  "frontend/src/main.tsx": "Bootstraps React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Empty file.",
  "frontend/src/pages/DiscordPage.tsx": "Displays Discord invite page using website config and styled UI components.",
  "frontend/src/pages/HistoryPage.tsx": "Displays the user's purchase history with status badges, timestamps, and item details, handling loading and empty states.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with server status, tagline, feature cards, and navigation buttons, using config-loaded data.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page showing an error message and a button linking back to the home page.",
  "frontend/src/pages/ShopPage.tsx": "Main shop interface allowing category filtering, cart management, checkout, and item browsing with memoized components.",
  "frontend/src/pages/VotePage.tsx": "Displays voting links for the server, using config-defined URLs when available and showing a loading state.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based parsing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project metadata and notes a fix request to improve website performance in both preview and editor. Lists performance issues and a pending feature request focused on optimization."
}